fix: draw diagrams instead of verbatims; update for consistency permisson table
